foam/overset_setup_template/movingMesh/constant/tables/DoFMotion.txt
4000
(
(0.0	 ((0 0.1 0) (0 0 3.5083546492674384e-16)))
(0.010002500625156289	 ((0 0.0999949975407704 0) (0 0 -0.05730913228645177)))
(0.020005001250312578	 ((0 0.0999799906635736 0) (0 0 -0.11461241619051635)))
(0.030007501875468866	 ((0 0.0999549808698354 0) (0 0 -0.17190400401953654)))
(0.040010002500625155	 ((0 0.09991997066176528 0) (0 0 -0.2291780494601501)))
(0.05001250312578144	 ((0 0.09987496354210601 0) (0 0 -0.2864287082675205)))
(0.06001500375093773	 ((0 0.09981996401378321 0) (0 0 -0.3436501389540676)))
(0.07001750437609403	 ((0 0.09975497757945484 0) (0 0 -0.40083650347753397)))
(0.08002000500125031	 ((0 0.09968001074096067 0) (0 0 -0.45798196792821877)))
(0.0900225056264066	 ((0 0.09959507099867176 0) (0 0 -0.5150807032152169)))
(0.10002500625156288	 ((0 0.09950016685074008 0) (0 0 -0.5721268857514967)))
(0.11002750687671918	 ((0 0.0993953077922482 0) (0 0 -0.6291146981376544)))
(0.12003000750187547	 ((0 0.09928050431425949 0) (0 0 -0.6860383298441818)))
(0.13003250812703177	 ((0 0.09915576790276824 0) (0 0 -0.742891977892086)))
(0.14003500875218805	 ((0 0.09902111103755074 0) (0 0 -0.7996698475317006)))
(0.15003750937734434	 ((0 0.09887654719091657 0) (0 0 -0.8563661529195286)))
(0.16004001000250062	 ((0 0.09872209082636069 0) (0 0 -0.9129751177929608)))
(0.1700425106276569	 ((0 0.09855775739711642 0) (0 0 -0.9694909761427096)))
(0.1800450112528132	 ((0 0.09838356334460938 0) (0 0 -1.0259079728828084)))
(0.19004751187796948	 ((0 0.09819952609681246 0) (0 0 -1.0822203645180175)))
(0.20005001250312576	 ((0 0.09800566406650224 0) (0 0 -1.1384224198084905)))
(0.21005251312828208	 ((0 0.0978019966494168 0) (0 0 -1.1945084204315466)))
(0.22005501375343836	 ((0 0.09758854422231514 0) (0 0 -1.2504726616404043)))
(0.23005751437859465	 ((0 0.09736532814093851 0) (0 0 -1.3063094529197292)))
(0.24006001500375093	 ((0 0.09713237073787387 0) (0 0 -1.3620131186378521)))
(0.25006251562890724	 ((0 0.09688969532031944 0) (0 0 -1.4175779986955175)))
(0.26006501625406353	 ((0 0.09663732616775285 0) (0 0 -1.4729984491710164)))
(0.2700675168792198	 ((0 0.09637528852950204 0) (0 0 -1.5282688429615887)))
(0.2800700175043761	 ((0 0.09610360862221906 0) (0 0 -1.5833835704209134)))
(0.2900725181295324	 ((0 0.09582231362725707 0) (0 0 -1.6383370399926285)))
(0.30007501875468867	 ((0 0.095531431687951 0) (0 0 -1.693123678839659)))
(0.31007751937984496	 ((0 0.09523099190680163 0) (0 0 -1.7477379334693275)))
(0.32008002000500124	 ((0 0.09492102434256415 0) (0 0 -1.8021742703540213)))
(0.3300825206301575	 ((0 0.09460156000724053 0) (0 0 -1.8564271765473956)))
(0.3400850212553138	 ((0 0.0942726308629771 0) (0 0 -1.910491160295895)))
(0.3500875218804701	 ((0 0.09393426981886649 0) (0 0 -1.9643607516455777)))
(0.3600900225056264	 ((0 0.09358651072765528 0) (0 0 -2.0180305030440335)))
(0.37009252313078267	 ((0 0.09322938838235695 0) (0 0 -2.071494989937377)))
(0.38009502375593895	 ((0 0.092862938512771 0) (0 0 -2.1247488113621267)))
(0.39009752438109524	 ((0 0.092487197781908 0) (0 0 -2.1777865905319467)))
(0.4001000250062515	 ((0 0.09210220378232178 0) (0 0 -2.2306029754190733)))
(0.41010252563140787	 ((0 0.091707995032348 0) (0 0 -2.2831926393304056)))
(0.42010502625656415	 ((0 0.09130461097225069 0) (0 0 -2.335550281478097)))
(0.43010752688172044	 ((0 0.09089209196027613 0) (0 0 -2.3876706275446216)))
(0.4401100275068767	 ((0 0.09047047926861511 0) (0 0 -2.4395484302421777)))
(0.450112528132033	 ((0 0.09003981507927361 0) (0 0 -2.4911784698663815)))
(0.4601150287571893	 ((0 0.08960014247985265 0) (0 0 -2.542555554844141)))
(0.4701175293823456	 ((0 0.08915150545923724 0) (0 0 -2.593674522275675)))
(0.48012003000750186	 ((0 0.08869394890319551 0) (0 0 -2.644530238470552)))
(0.49012253063265815	 ((0 0.08822751858988778 0) (0 0 -2.695117599477736)))
(0.5001250312578145	 ((0 0.08775226118528656 0) (0 0 -2.745431531609519)))
(0.5101275318829708	 ((0 0.0872682242385077 0) (0 0 -2.79546699195933)))
(0.5201300325081271	 ((0 0.08677545617705298 0) (0 0 -2.8452189689133256)))
(0.5301325331332833	 ((0 0.08627400630196515 0) (0 0 -2.8946824826557216)))
(0.5401350337584396	 ((0 0.08576392478289534 0) (0 0 -2.943852585667805)))
(0.5501375343835959	 ((0 0.08524526265308362 0) (0 0 -2.9927243632206015)))
(0.5601400350087522	 ((0 0.08471807180425313 0) (0 0 -3.0412929338611265)))
(0.5701425356339085	 ((0 0.08418240498141843 0) (0 0 -3.089553449892202)))
(0.5801450362590648	 ((0 0.08363831577760834 0) (0 0 -3.137501097845774)))
(0.5901475368842211	 ((0 0.0830858586285041 0) (0 0 -3.1851310989497295)))
(0.6001500375093773	 ((0 0.08252508880699296 0) (0 0 -3.232438709588172)))
(0.6101525381345336	 ((0 0.0819560624176383 0) (0 0 -3.279419221755109)))
(0.6201550387596899	 ((0 0.08137883639106637 0) (0 0 -3.3260679635015515)))
(0.6301575393848462	 ((0 0.08079346847827051 0) (0 0 -3.3723802993759984)))
(0.6401600400100025	 ((0 0.08020001724483307 0) (0 0 -3.418351630858298)))
(0.6501625406351588	 ((0 0.079598542065066 0) (0 0 -3.4639773967868477)))
(0.660165041260315	 ((0 0.07898910311607062 0) (0 0 -3.5092530737791483)))
(0.6701675418854713	 ((0 0.07837176137171686 0) (0 0 -3.5541741766456987)))
(0.6801700425106276	 ((0 0.07774657859654283 0) (0 0 -3.5987362587972314)))
(0.6901725431357839	 ((0 0.07711361733957539 0) (0 0 -3.642934912645268)))
(0.7001750437609402	 ((0 0.0764729409280722 0) (0 0 -3.686765769996028)))
(0.7101775443860965	 ((0 0.07582461346118584 0) (0 0 -3.7302245024376743)))
(0.7201800450112528	 ((0 0.07516869980355069 0) (0 0 -3.7733068217209285)))
(0.730182545636409	 ((0 0.07450526557879333 0) (0 0 -3.816008480133035)))
(0.7401850462615653	 ((0 0.07383437716296704 0) (0 0 -3.8583252708651137)))
(0.7501875468867216	 ((0 0.07315610167791076 0) (0 0 -3.900253028372911)))
(0.7601900475118779	 ((0 0.0724705069845337 0) (0 0 -3.941787628730991)))
(0.7701925481370342	 ((0 0.07177766167602583 0) (0 0 -3.9829249899803494)))
(0.7801950487621905	 ((0 0.07107763507099538 0) (0 0 -4.023661072469497)))
(0.7901975493873468	 ((0 0.07037049720653338 0) (0 0 -4.063991879189067)))
(0.800200050012503	 ((0 0.06965631883120654 0) (0 0 -4.103913456099945)))
(0.8102025506376594	 ((0 0.06893517139797894 0) (0 0 -4.143421892454954)))
(0.8202050512628157	 ((0 0.06820712705706328 0) (0 0 -4.182513321114156)))
(0.830207551887972	 ((0 0.06747225864870225 0) (0 0 -4.221183918853795)))
(0.8402100525131283	 ((0 0.06673063969588079 0) (0 0 -4.2594299066689265)))
(0.8502125531382846	 ((0 0.06598234439697052 0) (0 0 -4.297247550069763)))
(0.8602150537634409	 ((0 0.06522744761830583 0) (0 0 -4.334633159371807)))
(0.8702175543885972	 ((0 0.06446602488669395 0) (0 0 -4.371583089979798)))
(0.8802200550137534	 ((0 0.06369815238185826 0) (0 0 -4.408093742665535)))
(0.8902225556389097	 ((0 0.06292390692881678 0) (0 0 -4.444161563839613)))
(0.900225056264066	 ((0 0.0621433659901957 0) (0 0 -4.479783045817151)))
(0.9102275568892223	 ((0 0.061356607658479556 0) (0 0 -4.514954727077536)))
(0.9202300575143786	 ((0 0.06056371064819782 0) (0 0 -4.54967319251827)))
(0.9302325581395349	 ((0 0.05976475428804991 0) (0 0 -4.583935073702948)))
(0.9402350587646912	 ((0 0.05895981851296811 0) (0 0 -4.617737049103466)))
(0.9502375593898474	 ((0 0.05814898385612044 0) (0 0 -4.651075844336474)))
(0.9602400600150037	 ((0 0.05733233144085309 0) (0 0 -4.6839482323941795)))
(0.97024256064016	 ((0 0.05650994297257437 0) (0 0 -4.716351033869535)))
...
)