foam/overset_setup_template/movingMesh/constant/tables/pyTable
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       scalarVectorTable;
    object      pyTable;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

(
(0.0	(0 0.0 0))
(0.0010000250006250155	(0 0.002203829596636166 0))
(0.002000050001250031	(0 0.004405382779334338 0))
(0.0030000750018750466	(0 0.006602385485545407 0))
(0.004000100002500062	(0 0.008792568353069201 0))
(0.005000125003125078	(0 0.010973669064159372 0))
(0.006000150003750093	(0 0.01314343468235184 0))
(0.007000175004375109	(0 0.01529962397960294 0))
(0.008000200005000124	(0 0.01744000975133356 0))
(0.00900022500562514	(0 0.01956238111698792 0))
(0.010000250006250155	(0 0.021664545803730697 0))
(0.011000275006875171	(0 0.023744332410923597 0))
(0.012000300007500186	(0 0.025799592653042217 0))
(0.013000325008125202	(0 0.027828203578716595 0))
(0.014000350008750218	(0 0.029828069763603113 0))
(0.015000375009375233	(0 0.031797125474822815 0))
(0.01600040001000025	(0 0.03373333680473031 0))
(0.017000425010625264	(0 0.035634703771809335 0))
(0.01800045001125028	(0 0.037499262386524713 0))
(0.019000475011875295	(0 0.03932508667999697 0))
(0.02000050001250031	(0 0.04111029069340411 0))
(0.021000525013125326	(0 0.04285303042605549 0))
(0.022000550013750342	(0 0.04455150574012566 0))
(0.023000575014375357	(0 0.04620396222008078 0))
(0.024000600015000373	(0 0.04780869298487677 0))
(0.02500062501562539	(0 0.0493640404510574 0))
(0.026000650016250404	(0 0.05086839804493121 0))
(0.02700067501687542	(0 0.05232021186205855 0))
(0.028000700017500435	(0 0.053717982272334756 0))
(0.02900072501812545	(0 0.055060265469011375 0))
(0.030000750018750466	(0 0.05634567496005549 0))
(0.03100077501937548	(0 0.057572883000306614 0))
(0.0320008000200005	(0 0.05874062196295191 0))
(0.03300082502062551	(0 0.05984768564890296 0))
(0.03400085002125053	(0 0.060892930532721656 0))
(0.035000875021875544	(0 0.06187527694380837 0))
(0.03600090002250056	(0 0.062793710181632 0))
(0.037000925023125575	(0 0.06364728156385029 0))
(0.03800095002375059	(0 0.06443510940623748 0))
(0.039000975024375606	(0 0.0651563799334074 0))
(0.04000100002500062	(0 0.06581034811939084 0))
(0.04100102502562564	(0 0.06639633845719951 0))
(0.04200105002625065	(0 0.06691374565658113 0))
(0.04300107502687567	(0 0.0673620352692453 0))
(0.044001100027500684	(0 0.06774074424091407 0))
(0.0450011250281257	(0 0.06804948138962727 0))
(0.046001150028750715	(0 0.06828792780980816 0))
(0.04700117502937573	(0 0.06845583720167242 0))
(0.048001200030000746	(0 0.06855303612563991 0))
(0.04900122503062576	(0 0.06857942418148656 0))
(0.05000125003125078	(0 0.06853497411205137 0))
(0.05100127503187579	(0 0.06841973183139129 0))
(0.05200130003250081	(0 0.06823381637735497 0))
(0.05300132503312582	(0 0.06797741978862429 0))
(0.05400135003375084	(0 0.06765080690635082 0))
(0.055001375034375855	(0 0.06725431510059199 0))
(0.05600140003500087	(0 0.0667883539218295 0))
(0.057001425035625886	(0 0.06625340467793012 0))
(0.0580014500362509	(0 0.0656500199369857 0))
(0.05900147503687592	(0 0.06497882295654588 0))
(0.06000150003750093	(0 0.06424050703983326 0))
(0.06100152503812595	(0 0.06343583481960588 0))
(0.06200155003875096	(0 0.0625656374704066 0))
(0.06300157503937598	(0 0.06163081385001355 0))
(0.064001600040001	(0 0.060632329570977805 0))
(0.06500162504062601	(0 0.05957121600320802 0))
(0.06600165004125103	(0 0.0584485692086316 0))
(0.06700167504187604	(0 0.05726554880903355 0))
(0.06800170004250106	(0 0.05602337678824175 0))
(0.06900172504312607	(0 0.05472333622989657 0))
(0.07000175004375109	(0 0.05336676999210801 0))
(0.0710017750443761	(0 0.05195507932036996 0))
(0.07200180004500112	(0 0.05048972240016378 0))
(0.07300182504562613	(0 0.0489722128507468 0))
(0.07400185004625115	(0 0.047404118161681066 0))
(0.07500187504687617	(0 0.045787058073717794 0))
(0.07600190004750118	(0 0.04412270290570939 0))
(0.0770019250481262	(0 0.042412771829277815 0))
(0.07800195004875121	(0 0.040659031093021165 0))
(0.07900197504937623	(0 0.03886329219809252 0))
(0.08000200005000124	(0 0.03702741002703626 0))
(0.08100202505062626	(0 0.03515328092781365 0))
(0.08200205005125127	(0 0.03324284075499788 0))
(0.08300207505187629	(0 0.03129806287016084 0))
(0.0840021000525013	(0 0.029320956103518002 0))
(0.08500212505312632	(0 0.02731356267893605 0))
(0.08600215005375134	(0 0.025277956104447476 0))
(0.08700217505437635	(0 0.023216239030450208 0))
(0.08800220005500137	(0 0.02113054107780546 0))
(0.08900222505562638	(0 0.019023016638076436 0))
(0.0900022500562514	(0 0.0168958426481809 0))
(0.09100227505687641	(0 0.014751216341755429 0))
(0.09200230005750143	(0 0.012591352979554899 0))
(0.09300232505812644	(0 0.010418483561230702 0))
(0.09400235005875146	(0 0.00823485252085196 0))
(0.09500237505937648	(0 0.006042715408549899 0))
(0.09600240006000149	(0 0.003844336560679711 0))
(0.09700242506062651	(0 0.0016419867609072693 0))
(0.09800245006125152	(0 -0.0005620591053642805 0))
...
)