foam/overset_setup_template/movingMesh/0/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus-overset                          |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

flowVelocity         (-1 0 0);
pressure             0;
turbulentKE          0.0000375;
turbulentEpsilon     2.06675e-8;
turbulentOmega       0.0061237;

#inputMode           merge

// ************************************************************************* //
