foam/overset_setup_template/movingMesh/system/backGroundMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus-overset                          |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-12.0 -5.0 -5.0)
    (4.0 -5.0 -5)
    (4.0 5.0 -5.0)
    (-12.0 5.0 -5.0)
    (-12.0 -5.0 5.0)
    (4.0 -5.0 5)
    (4.0 5.0 5.0)
    (-12.0 5.0 5.0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) backgroundMesh (36 20 20) simpleGrading (1 1 1)

);

edges
(
);

boundary
(
 
);

// ************************************************************************* //
