foam/overset_setup_template/movingMesh/system/createCut.topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus-overset                          |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
   {
        name    oversetBox;
        type    cellSet;
        action  new;
        source  cylinderToCell;
        sourceInfo
        {
            p1  (-0.3 0 0);
            p2  (1 0 0);
            radius  0.1;
        }
    
    }
    {
        name    movingMesh;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set    oversetBox;
        }

    }
);

// ************************************************************************* //
