foam/overset_setup_template/movingMesh/system/createOverset.topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus-overset                          |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c0;
        type    cellSet;
        action  new;
        source  zoneToCell;
        sourceInfo
        {
            name    backgroundMesh;
        }
    }

    {
        name    c1;
        type    cellSet;
        action  new;
        source  zoneToCell;
        sourceInfo
        {
            name    movingMesh;
        }
    }
);

// ************************************************************************* //
